#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	КоличествоЗаписей = ЗаполнитьНаСервере();
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Заполнение средних цен'"),
		,
		СтрШаблон(НСтр("ru = 'Записано строк: %1'"), КоличествоЗаписей));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗаполнитьСредниеЦены();
	
КонецФункции

#КонецОбласти
