#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ДемонстрацияКлиента(Команда)
	
	ПутьКФайлу = ПутьКФайлуДемонстрации();
	ФайлСтраницы = Новый Файл(ПутьКФайлу);
	ФайлНайден = Ждать ФайлСтраницы.СуществуетАсинх();
	Если Не ФайлНайден Тогда
		Ждать ПредупреждениеАсинх(
			СтрШаблон(
				"Не найден файл демонстрации. Текущий путь: %1. Положите index.html в каталог WEB_City.",
				ПутьКФайлу));
		Возврат;
	КонецЕсли;
	
	Ждать ЗапуститьПриложениеАсинх(ПутьКФайлу);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПутьКФайлуДемонстрации()
	
	Возврат "C:\Users\n.voroncov\Documents\hahaton\WEB_City\index.html";
	
КонецФункции

#КонецОбласти
